tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
static uint8_t s_lcd_lvgl_bridged = 0;   // C LVGL display/indev bridge installed?

#if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
#define LCD_SPECTRUM_INPUT_BARS (27U)
#define LCD_SPECTRUM_COLUMNS    (256U)
#define LCD_SPECTRUM_MAX_H_PX   (50)
#define LCD_SPECTRUM_TICK_MS    (10U)
#define LCD_SPECTRUM_FRAME_MS   (100U)
#define LCD_WATERFALL_FRAME_MS  (33U)
#define LCD_SCOPE_FRAME_MS      (33U)
#define LCD_WATERFALL_PIXELS    (256U)
#define LCD_PANORAMA_SPAN_HZ    (24000)
#define LCD_SCOPE_PIXELS        (128U)
#define LCD_NATIVE_GAP_PX       (4)
#define LCD_TUNE_CURSOR_PX      (5U)
#define LCD_SCOPE_FULL_SCALE    (2048)
#define LCD_WATERFALL_TOP_PAD   (18)
#define LCD_WATERFALL_SPEC_H    (30)
#define LCD_WATERFALL_GAP_PX    (2)
#define LCD_VIEW_SPECTRUM       (0U)
#define LCD_VIEW_WATERFALL      (1U)
#define LCD_VIEW_OFF            (2U)
#define LCD_SCOPE_VIEW_TIME     (0U)
#define LCD_SCOPE_VIEW_IQ       (1U)
#define LCD_SCOPE_VIEW_OFF      (2U)
#define LCD_CONST_POINTS        (64U)
static lv_obj_t *s_lcd_spectrum_obj;
/* Declarative SPEC redraw state: one stored height for every physical X column.
 * Direct framebuffer commits and foreign/full LVGL redraws consume the same state. */
static int16_t s_lcd_spectrum_h[LCD_SPECTRUM_COLUMNS];
static lv_timer_t *s_lcd_spectrum_timer;
static lv_color_t s_lcd_spectrum_bg;
static lv_color_t s_lcd_spectrum_bar;
static lv_color_t s_lcd_spectrum_center;
static uint8_t s_lcd_spectrum_valid;
static uint8_t s_lcd_spectrum_view;
static uint8_t s_lcd_spectrum_paused;
static uint8_t s_lcd_waterfall_reset;
static uint8_t s_lcd_left_clear_pending;
static uint32_t s_lcd_spectrum_last_fft_ms;
static uint32_t s_lcd_waterfall_rows;
/* The selected/listening frequency is the coordinate of retained waterfall
 * history.  It is deliberately independent of the instantaneous DSP shift_bins:
 * an LO recenter changes shift_bins without moving the selected frequency and
 * therefore must not move old rows. */
static int32_t s_lcd_waterfall_center_hz;
static int64_t s_lcd_waterfall_pan_pending_hz;
static int32_t s_lcd_waterfall_pan_remainder;
static uint8_t s_lcd_waterfall_center_valid;
static uint32_t s_lcd_waterfall_last_us;
static uint32_t s_lcd_waterfall_max_us;
static uint32_t s_lcd_fft_last_us;
static uint32_t s_lcd_fft_max_us;
static int32_t s_lcd_const_peak;
static uint8_t s_lcd_scope_view;
static uint8_t s_lcd_right_clear_pending;
static uint32_t s_lcd_scope_last_ms;
static uint32_t s_lcd_render_start_us;
static uint32_t s_lcd_render_last_us;
static uint32_t s_lcd_render_max_us;
static uint32_t s_lcd_render_start_frame;
static uint32_t s_lcd_render_crossed_frames;
static uint32_t s_lcd_render_count;
static uint32_t s_lcd_inv_since_render;
static uint8_t s_lcd_render_in_progress;
static uint32_t s_touch_deferred_polls;
static uint32_t s_lcd_render_inv_count;
static uint32_t s_lcd_render_max_inv_count;
static uint32_t s_lcd_render_full_inv_request_count;
static int32_t s_lcd_inv_y1 = 0x7fffffffL;
static int32_t s_lcd_inv_y2 = -1;
static int32_t s_lcd_render_y1 = -1;
static int32_t s_lcd_render_y2 = -1;
static uint32_t s_lcd_render_area_height;
static uint32_t s_lcd_render_previous_height;
static uint32_t s_lcd_render_previous_inv_count;
static uint32_t s_lcd_beam_estimate_us;
static uint32_t s_lcd_beam_delay_last_us;
static uint32_t s_lcd_beam_delay_max_us;
static uint32_t s_lcd_beam_delay_count;
static uint32_t s_lcd_beam_no_window_count;

static void lcd_render_dirty_bounds_reset(void) {
    s_lcd_inv_y1 = 0x7fffffffL;
    s_lcd_inv_y2 = -1;
}

static void lcd_waterfall_pan_reset(bool forget_center) {
    s_lcd_waterfall_pan_pending_hz = 0;
    s_lcd_waterfall_pan_remainder = 0;
    if (forget_center) {
        s_lcd_waterfall_center_hz = 0;
        s_lcd_waterfall_center_valid = 0U;
    }
}

/* Translate the two UI selectors into three independent producer gates.  Callers
 * pass attached=false at every detach/deinit boundary; pause suppresses all three
 * without changing the selected views, so resume restores exactly that matrix. */
static void lcd_native_capture_apply(bool attached) {
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    bool active = attached && (s_lcd_spectrum_obj != NULL) &&
        !s_lcd_spectrum_paused;
    ra_iq_adc_spectrum_enable(active && (s_lcd_spectrum_view != LCD_VIEW_OFF));
    ra_iq_adc_constellation_enable(active &&
        (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ));
    ra_iq_adc_scope_enable(active &&
        (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME));
    #else
    (void)attached;
    #endif
}
#endif

void machine_lcd_lvgl_soft_reset(void) {
    #if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
    lcd_native_capture_apply(false);
    memset(&s_lcd_scroll_blit, 0, sizeof(s_lcd_scroll_blit));
    s_lcd_lvgl_display = NULL;
    s_lcd_lvgl_bridged = 0;
    if (lv_is_initialized()) {
        #if defined(USE_FSP_DRW)
        vk_ra6m3_dave2d_prepare_deinit();
        #endif
        lv_deinit();
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_timer = NULL;
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_view = LCD_VIEW_SPECTRUM;
        s_lcd_spectrum_paused = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_left_clear_pending = 0U;
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_waterfall_rows = 0U;
        lcd_waterfall_pan_reset(true);
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        s_lcd_const_peak = 32;
        s_lcd_scope_view = LCD_SCOPE_VIEW_TIME;
        s_lcd_right_clear_pending = 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_render_start_us = 0U;
        s_lcd_render_last_us = 0U;
        s_lcd_render_max_us = 0U;
        s_lcd_render_start_frame = 0U;
        s_lcd_render_crossed_frames = 0U;
        s_lcd_render_count = 0U;
        s_lcd_inv_since_render = 0U;
        s_lcd_render_in_progress = 0U;
        s_touch_deferred_polls = 0U;
        s_lcd_render_inv_count = 0U;
        s_lcd_render_max_inv_count = 0U;
        s_lcd_render_full_inv_request_count = 0U;
        lcd_render_dirty_bounds_reset();
        s_lcd_render_y1 = -1;
        s_lcd_render_y2 = -1;
        s_lcd_render_area_height = 0U;
        s_lcd_render_previous_height = 0U;
        s_lcd_render_previous_inv_count = 0U;
        s_lcd_beam_estimate_us = 0U;
        s_lcd_beam_delay_last_us = 0U;
        s_lcd_beam_delay_max_us = 0U;
        s_lcd_beam_delay_count = 0U;
        s_lcd_beam_no_window_count = 0U;
        s_lcd_vsync_timeouts = 0U;
        #if defined(USE_FSP_DRW)
        vk_ra6m3_dave2d_finish_deinit();
        #endif
    }
    #endif
}

void touch_i2c_callback(i2c_master_callback_args_t *p_args) {
    s_touch_i2c_event = p_args->event;
    I2C_complete = 1;
}

static bool touch_i2c_wait(i2c_master_event_t expected_event) {
    uint32_t start_ms = (uint32_t)mp_hal_ticks_ms();
    while (!I2C_complete) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - start_ms) >= FT5X06_I2C_TIMEOUT_MS) {
            s_touch_i2c_timeouts++;
            (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
            return false;
        }
    }

