tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    if (s_touch_i2c_event != expected_event) {
        s_touch_i2c_errors++;
        return false;
    }
    return true;
}

static bool ft5x06_payload_get(void) {
    machine_lcd_obj_t *self = &machine_lcd_obj;
    touch_coord_t new_touch;
    ft5x06_payload_t touch_payload;

    /* Clear payload struct */
    memset(&touch_payload, 0, sizeof(ft5x06_payload_t));

    /* Read the data about the touch point(s) */
    uint8_t reg = FT5X06_REG_TD_STATUS;

    /* Write TD_STATUS address */
    I2C_complete = 0;
    s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (FSP_SUCCESS != R_SCI_I2C_Write(&g_i2c_touch_ctrl, &reg, 1, true)) {
        s_touch_i2c_errors++;
        (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
        return false;
    }
    if (!touch_i2c_wait(I2C_MASTER_EVENT_TX_COMPLETE)) {
        return false;
    }

    /* Read TD_STATUS through all five TOUCHn_** register sets */
    I2C_complete = 0;
    s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (FSP_SUCCESS != R_SCI_I2C_Read(&g_i2c_touch_ctrl, (uint8_t *)&touch_payload,
        sizeof(ft5x06_payload_t), false)) {
        s_touch_i2c_errors++;
        (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
        return false;
    }
    if (!touch_i2c_wait(I2C_MASTER_EVENT_RX_COMPLETE)) {
        return false;
    }

    uint8_t num_points = touch_payload.num_points_active & 0x0fU;
    if (num_points > FT5X06_NUM_POINTS) {
        num_points = FT5X06_NUM_POINTS;
    }
    bool any_active = false;
    int16_t release_x = s_lcd_touch_x;
    int16_t release_y = s_lcd_touch_y;

    if (num_points) {
        /* Process the raw data for the touch point(s) into useful data */
        for (uint8_t i = 0; i < num_points; i++)
        {
            new_touch.x = (uint16_t)extract_x(touch_payload.data_raw[i]);
            new_touch.y = (uint16_t)extract_y(touch_payload.data_raw[i]);
            new_touch.event = extract_e(touch_payload.data_raw[i]);
            bool point_active = false;

            /* Set event type based on received data */
            switch (new_touch.event)
            {
                case FT5X06_DOWN:
                    self->point[i].event = TOUCH_EVENT_DOWN;
                    point_active = true;
                    break;
                case FT5X06_UP:
                    self->point[i].event = TOUCH_EVENT_UP;
                    break;
                case FT5X06_CONTACT:
                    /* Check if the point is moving or not */
                    if ((self->point[i].x != new_touch.x) || (self->point[i].y != new_touch.y)) {
                        self->point[i].event = TOUCH_EVENT_MOVE;
                    } else {
                        self->point[i].event = TOUCH_EVENT_HOLD;
                    }
                    point_active = true;
                    break;
                default:
                    self->point[i].event = TOUCH_EVENT_NONE;
                    break;
            }

            /* Set new coordinates */
            self->point[i].x = new_touch.x;
            self->point[i].y = new_touch.y;
            release_x = (int16_t)new_touch.x;
            release_y = (int16_t)new_touch.y;
            if (point_active) {
                any_active = true;
                s_lcd_touch_x = (int16_t)new_touch.x;
                s_lcd_touch_y = (int16_t)new_touch.y;
            }
        }
    }

    /* Preserve the last release position, and publish every packet (including UP/zero). */
    if (!any_active && num_points) {
        s_lcd_touch_x = release_x;
        s_lcd_touch_y = release_y;
    }
    self->num_points = num_points;
    s_lcd_touch_active = any_active ? 1U : 0U;
    return true;
}

static bool touch_service_pending(void) {
    bool pending;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    pending = s_touch_read_pending != 0U;
    s_touch_read_pending = 0;
    FSP_CRITICAL_SECTION_EXIT;

    if (!pending) {
        return true;
    }
    if (!ft5x06_payload_get()) {
        machine_lcd_obj.num_points = 0;
        s_lcd_touch_active = 0;
        return false;
    }
    return true;
}

void callback_icu(external_irq_callback_args_t *p_args) { // callback_icu
    if (g_external_irq11_cfg.channel == p_args->channel) {
        /* Never transact on SCI-I2C in the external IRQ. The next LVGL/Python poll
         * consumes this flag and performs one bounded foreground transaction. */
        s_touch_irq_count++;
        s_touch_read_pending = 1;
    }
}

static volatile uint32_t lcd_vsync_counter = 0;

void lcd_Vsync_ISR(display_callback_args_t *p_args) {
    (void)p_args;
    lcd_vsync_counter++;
}

STATIC mp_int_t machine_lcd_set_buffer(mp_obj_t self_in, mp_buffer_info_t *bufinfo, mp_uint_t flags) {
    // mp_obj_framebuf_t *self = MP_OBJ_TO_PTR(self_in);
    bufinfo->buf = g_display0_cfg.input[0].p_base;
    bufinfo->len = g_display0_cfg.input[0].hstride * g_display0_cfg.input[0].vsize * ((g_display0_cfg.input[0].format < DISPLAY_IN_FORMAT_16BITS_RGB565)? 4 : 2);
    bufinfo->typecode = 'B'; // view framebuf as bytes
    return 0;
}

STATIC mp_obj_t machine_lcd_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 0, 0, false);

    // return self object
    return MP_OBJ_FROM_PTR(&machine_lcd_obj);
}

STATIC mp_obj_t lcd_init(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->isinited) {
        size_t framebuffer_size = g_display0_cfg.input[0].hstride *
            g_display0_cfg.input[0].vsize * sizeof(uint16_t);
        memset(g_display0_cfg.input[0].p_base, 0, framebuffer_size);

        if (FSP_SUCCESS == R_GLCDC_Open(&g_display0_ctrl, &g_display0_cfg)) {
            self->isinited = 1;
            ra_gpio_config(self->bl->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
            ra_gpio_config(self->en->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
            ra_gpio_write(self->bl->pin, 1);
            ra_gpio_write(self->en->pin, 1);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init R_GLCDC"));
        }

        ra_gpio_config(self->tch->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_LOW_POWER, 0);
        ra_gpio_write(self->tch->pin, 1);

        if (FSP_SUCCESS != R_SCI_I2C_Open(&g_i2c_touch_ctrl, &g_i2c_touch_cfg)) {
            machine_lcd_soft_reset();
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init R_SCI"));
        }

        self->num_points = 0;
        s_touch_read_pending = 0;
        s_lcd_touch_active = 0;
        s_lcd_touch_x = 0;
        s_lcd_touch_y = 0;
        memset(&locked, 0, sizeof(locked));

        /* Enable touch IRQ only after the touch I2C instance is ready. */
        if (FSP_SUCCESS != R_ICU_ExternalIrqOpen(&g_external_irq11_ctrl, &g_external_irq11_cfg) ||
            FSP_SUCCESS != R_ICU_ExternalIrqEnable(&g_external_irq11_ctrl)) {
            machine_lcd_soft_reset();
            mp_raise_ValueError(MP_ERROR_TEXT("Can't init touch IRQ"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Olready inited!"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_init_obj, lcd_init);

STATIC mp_obj_t lcd_touched(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);

    /* Legacy Python input path: service the same IRQ-pending flag as the C bridge. */
    (void)touch_service_pending();

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    if (!locked.num_stamp_points) {
        if (self->num_points) {
            locked.num_stamp_points = (self->num_points > FT5X06_NUM_POINTS)? FT5X06_NUM_POINTS : self->num_points;

