tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
            for (uint8_t i = 0; i < locked.num_stamp_points; i++) {
                locked.stamp_point[i] = self->point[i];
            }

            self->num_points = 0;
        } else {
            locked.num_stamp_points = 0;
        }
    }

    FSP_CRITICAL_SECTION_EXIT;

    return MP_OBJ_NEW_SMALL_INT(locked.num_stamp_points);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touched_obj, lcd_touched);

STATIC mp_obj_t lcd_touches(mp_obj_t self_in) {
    // machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);

    const char *ev[] = {"NONE", "DOWN", "HOLD", "MOVE", "UP"};

    if (!locked.num_stamp_points) {
        lcd_touched(self_in);
    }

    mp_obj_list_t *list = mp_obj_new_list(locked.num_stamp_points, NULL);

    if (locked.num_stamp_points) {
        // Add elements to the list
        for (uint8_t i = 0; i < locked.num_stamp_points; i++) {
            list->items[i] = mp_obj_new_tuple(3, (mp_obj_t[]) {mp_obj_new_int(locked.stamp_point[i].x), mp_obj_new_int(locked.stamp_point[i].y), mp_obj_new_str(ev[locked.stamp_point[i].event], strlen(ev[locked.stamp_point[i].event]))});
        }

        locked.num_stamp_points = 0;
    }
    return MP_OBJ_FROM_PTR(list);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touches_obj, lcd_touches);

#if defined(USE_FSP_DRW)
STATIC mp_obj_t lcd_drw_stats(mp_obj_t self_in) {
    (void)self_in;
    uint32_t irq_count;
    uint32_t allocation_count;
    uint32_t active_bytes;
    uint32_t peak_bytes;
    vk_ra6m3_dave2d_get_stats(&irq_count, &allocation_count, &active_bytes, &peak_bytes);
    mp_obj_t stats[] = {
        mp_obj_new_int_from_uint(irq_count),
        mp_obj_new_int_from_uint(allocation_count),
        mp_obj_new_int_from_uint(active_bytes),
        mp_obj_new_int_from_uint(peak_bytes),
    };
    return mp_obj_new_tuple(MP_ARRAY_SIZE(stats), stats);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_drw_stats_obj, lcd_drw_stats);
#endif

STATIC mp_obj_t lcd_deinit(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->isinited) {
        machine_lcd_soft_reset();
        if (self->isinited) {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't deinit LCD"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Not inited! call LCD.init() first"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_deinit_obj, lcd_deinit);

STATIC mp_obj_t lcd_start(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->isstarted) {
        if (FSP_SUCCESS == R_GLCDC_Start(&g_display0_ctrl)) {
            self->isstarted = 1;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't start R_GLCDC"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Olready started!"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_start_obj, lcd_start);

STATIC mp_obj_t lcd_stop(mp_obj_t self_in) {
    machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->isstarted) {
        if (FSP_SUCCESS == R_GLCDC_Stop(&g_display0_ctrl)) {
            #if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
            s_lcd_scroll_blit.pending = 0U;
            #endif
            self->isstarted = 0;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("Can't stop R_GLCDC"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("Not started! call LCD.start() first"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_stop_obj, lcd_stop);

/*
STATIC mp_obj_t lcd_changebuf(mp_obj_t self_in, mp_obj_t idx){
	machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
	mp_int_t i = mp_obj_get_int(idx);

	self->ischanged = 0;
	if(self->isinited && self->isstarted)
		if(FSP_SUCCESS == R_GLCDC_BufferChange(&g_display0_ctrl, fb_background[i? 1 : 0], DISPLAY_FRAME_LAYER_1))
		{
			self->ischanged = 1;
			self->idx = i;
		}
	return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_changebuf_obj, lcd_changebuf);
*/
// vsync([timeout_ms=25]) -- block until the NEXT GLCDC line-detect (VSYNC)
// event or timeout. Returns True if the pulse arrived, False on timeout.
// Used to gate LVGL render start so DIRECT-mode drawing chases the scanout
// beam instead of racing it mid-frame (visible flicker on frequent updates).
STATIC mp_obj_t lcd_vsync(size_t n_args, const mp_obj_t *args) {
    (void)args;
    uint32_t timeout_ms = (n_args > 1) ? (uint32_t)mp_obj_get_int(args[1]) :
        LCD_VSYNC_TIMEOUT_MS;
    uint32_t start_cnt = lcd_vsync_counter;
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= timeout_ms) {
            s_lcd_vsync_timeouts++;
            return mp_const_false;
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_vsync_obj, 1, 2, lcd_vsync);

/* ---- C LVGL display + input bridge -----------------------------------------------
 * Replaces the per-frame Python flush/touch/VSYNC callbacks in pRGB.py.  Those allocate
 * MicroPython wrapper objects on every render (flush) and every ~30 Hz input poll (read)
 * -- a continuous idle garbage stream that forces GC.  Registering the same three
 * callbacks in C removes that garbage entirely.  DIRECT single-framebuffer, identical
 * behaviour to the Python path (GLCDC framebuffer, cached FT5x06 touch, VSYNC gate). */
static void lcd_lv_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    (void)area;
    (void)px_map;
    lv_display_flush_ready(disp);                    // DIRECT mode: drawing is done
}

static volatile uint32_t s_indev_calls = 0;          // diag: LVGL polls of the read cb
static volatile uint32_t s_indev_press = 0;          // diag: reads that saw a contact

static void lcd_lv_indev_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
    (void)indev;
    s_indev_calls++;
    /* Never deliver a new touch point while LVGL is rendering. Re-reporting the
     * cached point creates no new scroll delta; the newest FT5X06 sample stays
     * pending and is consumed after LV_EVENT_RENDER_READY. A merely pending dirty
     * area is not an active render and must not halve the input update rate. */
    if (s_lcd_render_in_progress == 0U) {
        (void)touch_service_pending();
    } else if (s_touch_read_pending != 0U) {
        s_touch_deferred_polls++;
    }

