tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    /* This callback owns only the left plot.  The right TIME/I-Q panel is a
     * separate native framebuffer surface and survives foreign/full redraws. */
    rect.bg_color = s_lcd_spectrum_bg;
    lv_draw_rect(layer, &rect, &plot_area);

    int32_t plot_h = lv_area_get_height(&plot_area);
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        int32_t height = s_lcd_spectrum_h[x];
        if (height <= 0) {
            continue;
        }
        if (height > plot_h) {
            height = plot_h;
        }
        lv_area_t column = {
            .x1 = plot_area.x1 + (int32_t)x,
            .x2 = plot_area.x1 + (int32_t)x,
            .y1 = plot_area.y2 - height + 1,
            .y2 = plot_area.y2,
        };
        if ((column.x2 < layer->_clip_area.x1) ||
            (column.x1 > layer->_clip_area.x2) ||
            (column.y2 < layer->_clip_area.y1) ||
            (column.y1 > layer->_clip_area.y2)) {
            continue;
        }
        rect.bg_color = s_lcd_spectrum_bar;
        lv_draw_rect(layer, &rect, &column);
    }
    int32_t cursor_x = plot_area.x1 + (int32_t)(LCD_WATERFALL_PIXELS / 2U);
    lv_area_t cursor_area = {
        .x1 = cursor_x - (int32_t)(LCD_TUNE_CURSOR_PX / 2U),
        .x2 = cursor_x + (int32_t)(LCD_TUNE_CURSOR_PX / 2U),
        .y1 = plot_area.y1,
        .y2 = plot_area.y1 + 2,
    };
    if (!((cursor_area.x2 < layer->_clip_area.x1) ||
          (cursor_area.x1 > layer->_clip_area.x2) ||
          (cursor_area.y2 < layer->_clip_area.y1) ||
          (cursor_area.y1 > layer->_clip_area.y2))) {
        cursor_area.y2 = cursor_area.y1;
        rect.bg_color = lv_color_make(0U, 0U, 0U);
        lv_draw_rect(layer, &rect, &cursor_area);
        cursor_area.x1++;
        cursor_area.x2--;
        cursor_area.y1++;
        cursor_area.y2++;
        rect.bg_color = lv_color_make(255U, 255U, 255U);
        lv_draw_rect(layer, &rect, &cursor_area);
        cursor_area.x1++;
        cursor_area.x2--;
        cursor_area.y1++;
        cursor_area.y2++;
        rect.bg_color = s_lcd_spectrum_center;
        lv_draw_rect(layer, &rect, &cursor_area);
    }
    s_lcd_spectrum_valid = 1U;
}

static lv_obj_t *lcd_lv_obj_from_mp(mp_obj_t obj_in) {
    mp_buffer_info_t bi;
    mp_get_buffer_raise(obj_in, &bi, MP_BUFFER_READ);
    if (bi.len != sizeof(lv_obj_t *)) {
        mp_raise_ValueError(MP_ERROR_TEXT("expected LVGL object"));
    }
    lv_obj_t *obj = NULL;
    memcpy(&obj, bi.buf, sizeof(obj));
    if ((obj == NULL) || !lv_obj_is_valid(obj)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid LVGL object"));
    }
    return obj;
}

// spectrum_attach(obj[, bg_rgb, bar_rgb, center_rgb]) -> bool
// Attach the single native spectrum surface and delete the legacy bar children.
STATIC mp_obj_t lcd_spectrum_attach(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (!lv_is_initialized()) {
        return mp_const_false;
    }
    lv_obj_t *obj = lcd_lv_obj_from_mp(args[1]);
    uint32_t bg = (n_args > 2U) ? (uint32_t)mp_obj_get_int(args[2]) : 0xFFFFFFU;
    uint32_t bar = (n_args > 3U) ? (uint32_t)mp_obj_get_int(args[3]) : 0xB6BDC6U;
    uint32_t center = (n_args > 4U) ? (uint32_t)mp_obj_get_int(args[4]) : 0x0097A7U;

    s_lcd_spectrum_bg = lv_color_hex(bg & 0xFFFFFFU);
    s_lcd_spectrum_bar = lv_color_hex(bar & 0xFFFFFFU);
    s_lcd_spectrum_center = lv_color_hex(center & 0xFFFFFFU);

    if (s_lcd_spectrum_obj != obj) {
        lv_timer_t *new_timer = lv_timer_create(lcd_lv_spectrum_timer_cb,
            LCD_SPECTRUM_TICK_MS, NULL);
        if (new_timer == NULL) {
            return mp_const_false;
        }
        if ((s_lcd_spectrum_obj != NULL) && lv_obj_is_valid(s_lcd_spectrum_obj)) {
            (void)lv_obj_remove_event_cb(s_lcd_spectrum_obj, lcd_lv_spectrum_event_cb);
        }
        lv_obj_clean(obj);
        memset(s_lcd_spectrum_h, 0, sizeof(s_lcd_spectrum_h));
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_view = LCD_VIEW_SPECTRUM;
        s_lcd_spectrum_paused = 0U;
        s_lcd_waterfall_reset = 1U;
        lcd_waterfall_pan_reset(false);
        s_lcd_left_clear_pending = 0U;
        s_lcd_spectrum_last_fft_ms = (uint32_t)mp_hal_ticks_ms();
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        s_lcd_const_peak = 32;
        s_lcd_scope_view = LCD_SCOPE_VIEW_TIME;
        s_lcd_right_clear_pending = 0U;
        s_lcd_scope_last_ms = s_lcd_spectrum_last_fft_ms;
        s_lcd_spectrum_obj = obj;
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DRAW_MAIN, NULL);
        lv_obj_add_event_cb(obj, lcd_lv_spectrum_event_cb, LV_EVENT_DELETE, NULL);
        if (s_lcd_spectrum_timer != NULL) {
            lv_timer_delete(s_lcd_spectrum_timer);
        }
        s_lcd_spectrum_timer = new_timer;
    }
    lcd_native_capture_apply(true);
    lv_obj_invalidate(obj);
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_attach_obj, 2, 5,
    lcd_spectrum_attach);

// spectrum_update(array('h', 27)) -> number of changed input heights, or False if detached.
// Preserve the Python/demo API by expanding 27 input heights across the persistent
// 256-column SPEC state.  Live SPEC frames bypass this compatibility path and use
// the raw 512-bin magnitude/ref_peak/shift_bins panorama mapping.
STATIC mp_obj_t lcd_spectrum_update(mp_obj_t self_in, mp_obj_t buf_in) {
    (void)self_in;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_valid = 0U;
        lcd_native_capture_apply(false);
        return mp_const_false;
    }
    if (s_lcd_spectrum_view != LCD_VIEW_SPECTRUM) {
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    mp_buffer_info_t bi;
    mp_get_buffer_raise(buf_in, &bi, MP_BUFFER_READ);
    if ((bi.typecode != 'h') ||
        (bi.len < LCD_SPECTRUM_INPUT_BARS * sizeof(int16_t))) {
        mp_raise_ValueError(MP_ERROR_TEXT("buf must be array('h', >=27)"));
    }
    const int16_t *src = (const int16_t *)bi.buf;

    uint8_t input_changed[LCD_SPECTRUM_INPUT_BARS] = { 0 };
    uint32_t changed_columns = 0U;
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        uint32_t input = (x * LCD_SPECTRUM_INPUT_BARS) / LCD_SPECTRUM_COLUMNS;
        int16_t h = src[input];
        if (h < 2) {
            h = 2;
        } else if (h > LCD_SPECTRUM_MAX_H_PX) {
            h = LCD_SPECTRUM_MAX_H_PX;
        }
        if (!s_lcd_spectrum_valid || (h != s_lcd_spectrum_h[x])) {
            s_lcd_spectrum_h[x] = h;
            input_changed[input] = 1U;
            changed_columns++;
        }
    }
    uint32_t changed_inputs = 0U;
    for (uint32_t input = 0U; input < LCD_SPECTRUM_INPUT_BARS; ++input) {
        changed_inputs += input_changed[input];
    }
    s_lcd_spectrum_valid = 1U;
    if ((changed_columns != 0U) && !s_lcd_spectrum_paused &&
        (lv_obj_get_screen(s_lcd_spectrum_obj) == lv_screen_active())) {
        lcd_spectrum_write();
    }
    return MP_OBJ_NEW_SMALL_INT((mp_int_t)changed_inputs);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_spectrum_update_obj, lcd_spectrum_update);

// spectrum_center(selected_hz) -> True
// Establish/update the absolute selected-frequency coordinate used only by
// retained waterfall history.  The first call establishes a baseline; repeating
// the same value is idempotent.  New FFT rows continue to use DSP shift_bins.
STATIC mp_obj_t lcd_spectrum_center(mp_obj_t self_in, mp_obj_t selected_in) {
    (void)self_in;
    int32_t selected_hz = (int32_t)mp_obj_get_int(selected_in);
    if (!s_lcd_waterfall_center_valid) {
        s_lcd_waterfall_center_hz = selected_hz;
        s_lcd_waterfall_center_valid = 1U;
        lcd_waterfall_pan_reset(false);
        return mp_const_true;
    }

